app/controllers/favorites_controller.rb

    def index
        favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

    def create
        favorite = Favorite.new(favorite_trailer_params)
        if favorite.valid?
            favorite.save
---
INSERT INTO "favorites" ("user_id", "video_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["video_id", 1], ["created_at", "2021-11-06 18:24:08.438863"], ["updated_at", "2021-11-06 18:24:08.438863"]]

    def destroy
        favorite = Favorite.find(params[:id])
        favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]