app/controllers/follows_controller.rb

    def index
        follow = Follow.all
---
SELECT "follows".* FROM "follows"

    def create
        follow = Follow.new(init_follow_params)
        if follow.valid?
            follow.save
---
INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followed_user_id", 2], ["created_at", "2021-11-17 20:20:07.327460"], ["updated_at", "2021-11-17 20:20:07.327460"]]