app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.valid?
            user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "testName"], ["password", "password"], ["created_at", "2021-11-03 16:09:43.574075"], ["updated_at", "2021-11-03 16:09:43.574075"]]