app/controllers/videos_controller.rb

    def index
        videos = Video.all
---
SELECT "videos".* FROM "videos"